#------------------------------------------------------------------------------#
#--------------------------------------#
# 3-2 離散型確率変数と離散型確率分布   #
#--------------------------------------#

# ----- 3-2-1 期待値と分散 -----#
x <- 1:6            # サイコロの出目（x）
p <- rep(1/6, 6)    # １～６までの出目の確率（p）
# サイコロの出目（x）の期待値
ex <- sum(x * p)    

ex2 <- sum(x^2 * p) # X^2の期待値
e2 <- ex^2          # 期待値の2乗
#分散
vx <- e_x2 - e_2
# 標準偏差
stdx <- sqrt(vx)    

# 結果の表示
cat("期待値", sprintf("%.1f", ex), "\n")
cat("分散",   sprintf("%.2f", vx), "\n")
cat("標準偏差", sprintf("%.1f", stdx), "\n")

# ----- 3-2-2 二項分布 -----#
library(MASS)    # fractions関数使用のため

# パラメータ設定
n <- 3               # 抽出人数
p <- 1/4             # 喫煙率

# 喫煙者数の出現確率を計算
x <- 0:n             # x=0, 1, 2, 3
prob <- dbinom(x, size = n, prob = p)

# 分数に変換
frac_prob <- as.character(fractions(prob))

# 表3-3の表示
table3_3 <- rbind(
  X    = c("", x),
  確率 = c("", frac_prob)
)
noquote(table3_3)     # 見やすく表示（"" の引用符を消す）

# 二項分布の期待値と分散
e <- n * p            # 期待値
v <- n * p * (1 - p)  # 分散

# 分数に変換
frac_e <- as.character(fractions(e))
frac_v <- as.character(fractions(v))

# 結果の表示
cat("期待値", frac_e, "\n")
cat("分散", frac_v, "\n")

# ----- 3-2-3 ポアソン分布 -----#
# データの読み込み
data(discoveries)

# 平均 λ 
lambda <- mean(discoveries)
cat("平均 λ ", lambda, "\n")

# 平均発明件数λにおける発明件数0〜6件の確率を出力
d <- 0:6                         # 発明件数
probs <- dpois(d, lambda)        # 発明件数0〜6件の確率
# 結果の表示
names(probs) <- paste0(d, "件")
print(probs)

# P(X ≥ 9) を計算：P(X ≥ 9) = 1 - P(X ≤ 8)
p_ge_9 <- 1 - ppois(8, lambda)
# 結果の表示
cat("P(X ≥ 9) =", p_ge_9, "\n")


#--------------------------------------#
# 3-3 連続型確率変数と連続型確率分布   #
#--------------------------------------#

# ----- 3-3-3 標準正規分布 -----#
# P(0 ≤ Z ≤ 0.5)
p1 <- pnorm(0.5) - pnorm(0)
# 結果を表示
cat("P(0 ≤ Z ≤ 0.5) =", p1, "\n")

#	P(-0.8 ≤ Z ≤ 0)
p2 <- pnorm(0) - pnorm(-0.8)
# 結果を表示
cat("P(-0.8 ≤ Z ≤ 0) =", p2, "\n")

# P(-0.8 ≤ Z ≤ 0.5)
p3 <- pnorm(0.5) - pnorm(-0.8)
# 結果を表示
cat("P(-0.8 ≤ Z ≤ 0.5) =", p3, "\n")

# P(Z ≤ -0.8)
p4 <- pnorm(-0.8)
# 結果を表示
cat("P(Z ≤ -0.8) =", p4, "\n")

#	P(Z ≥ -0.8)
p5 <- 1 - pnorm(-0.8)
# 結果を表示
cat("P(Z ≥ -0.8) =", p5, "\n")

# ----- 3-3-4 確率変数の標準化 -----#
　　
mu <- 170.2                  # 平均
std_dev <- 6.8               # 標準偏差
# P(165 < X < 175) の計算
p <- pnorm(175, mean = mu, sd = std_dev) - pnorm(165, mean = mu, sd = std_dev)
# 結果を表示(教科書は標準正規分布表に基づく計算のため誤差がある)
cat("P(165 < X < 175) ", p, "\n")