#------------------------------------------------------------------------------#
# 第3章問題                                                                    #
#------------------------------------------------------------------------------#

#------------------------#
# 問2                    #
#------------------------#

#-------- 問2 ① ---------#
n <- 20        # 試行回数（患者数）
p <- 0.41      # 奏効率（成功確率）

# 期待値と分散
expected_value <- n * p
variance <- n * p * (1 - p)
# 結果の表示
cat("期待値", expected_value, "\n")
cat("分散", variance, "\n")

#-------- 問2 ② ---------#
n <- 20        # 試行回数（患者数）
p <- 0.41      # 奏効率（成功確率）

# P(X ≥ 15) = 1 - P(X ≤ 14)を計算
prob_15_or_more <- 1 - pbinom(14, size = n, prob = p)
# 結果の表示
cat("P(X ≥ 15)", prob_15_or_more, "\n")
cat(sprintf("P(X ≥ 15) %.3f\n", round(prob_15_or_more, 3)))


#------------------------#
# 問3                    #
#------------------------#

#-------- 問3 ① ---------#
# 平均と分散 λ
lambda <- 606 / 646
cat(sprintf("平均 λ %.3f\n", round(lambda, 3)))
cat(sprintf("分散 λ %.3f\n", round(lambda, 3)))

#-------- 問3 ② ---------#
# P(X≥3)を計算
p_ge_3 <- 1 - ppois(2, lambda)
# 結果の表示
cat(sprintf("P(X≥3) %.3f\n", round(p_ge_3, 3)))


#------------------------#
# 問4                    #
#------------------------#

#-------- 問4 ① ---------#
mu <- 23.7             # 平均
std_dev <- 3.6         # 標準偏差
# P(18 < X < 25) の計算
p <- pnorm(25, mean = mu, sd = std_dev) - pnorm(18, mean = mu, sd = std_dev)
# 結果を表示(教科書は標準正規分布表に基づく計算のため誤差がある)
cat("P(18 < X < 25) ", p, "\n")

#-------- 問4 ② ---------#
# 上位10%に該当するZ値（パーセンタイル）
z_10 <- qnorm(0.9)

# BMIの閾値を計算
threshold_bmi <- mu + z_10 * std_dev
# 結果の表示
cat(sprintf("BMI %.1f\n", round(threshold_bmi, 1)))


