#------------------------------------------------------------------------------#
#---------------------------------------#
# 4-2 母集団分布と標本分布              #
#---------------------------------------#

# ----- 4-2-1 正規母集団と標本分布 -----#
mu <- 115.3         # 母平均
sigma <- 13.7       # 母標準偏差
n <- 10             # 標本サイズ

# 標本平均の標準偏差（標準誤差）
se <- sigma / sqrt(n)

# P(標本平均 <= 110) = P(Z <= (110 - mu) / se)の計算
z <- (110 - mu) / se

prob <- pnorm(z)  # 標準正規分布における確率
# 結果の出力
cat("P(標本平均 ≦ 110) ", prob, "\n")

# ----- 4-2-2 母比率と標本比率 -----#
p <- 0.363          # 母比率（高血圧の割合）
n <- 200            # 標本サイズ
phat <- 0.40        # 観測された標本比率

se <- sqrt(p * (1 - p) / n)  # 標準誤差（SE）
z <- (phat - p) / se  # 標準化（Zスコア）

# 正規分布による近似確率
prob <- 1 - pnorm(z)  # P(標本比率 >= 0.40)
# 結果の出力
cat("P(標本比率 ≧ 0.40) =", prob, "\n")


#---------------------------------------#
# 4-3 正規母集団の標本分布              #
#---------------------------------------#

# ----- χ2分布  -----#
# 自由度5のχ²分布の上側5%点を計算
qchisq(p = 0.95, df = 5)

#標本の分散が20を超える確率
# 自由度
df <- 9
# カイ二乗値
chi_sq_value <- 18
# 上側確率（P(χ² > 18)）
p_value <- pchisq(q = chi_sq_value, df = df, lower.tail = FALSE)
# 結果の表示
cat("P(標本分散 ≧ 20) =", prob, "\n")

# ----- t分布  -----#
# 自由度10のt分布の上側5%点を計算
qt(0.95, df = 10)

#標本平均が24を超える確率
mu <- 20
n <- 10
U2 <- 25
X_bar <- 24
  
SE <- sqrt(U2) / sqrt(n)      # 標準誤差
t_value <- (X_bar - mu) / SE  # t統計量
df <- n - 1                   # 自由度
# 上側確率を計算（P(T ≥ t_value)）
p_value <- pt(t_value, df = df, lower.tail = FALSE)
# 結果表示
cat("P(X̄ ≥ 24) =", round(p_value, 4), "\n")

# ----- F分布  -----#
# 自由度(5, 10)のF分布の上側5%点を計算
qf(0.95, df1 = 5, df2 = 10)

#分散比(U1^2)⁄(U2^2)が3倍以上となる確率
# 自由度
df1 <- 10 - 1  # n1 = 10
df2 <- 20 - 1  # n2 = 20
# 分散比が3以上となる確率
p_value <- pf(3, df1 = df1, df2 = df2, lower.tail = FALSE)
# 結果表示
cat("P(U1^2 / U2^2 ≥ 3) =", round(p_value, 4), "\n")




