#-------------------------------------------------------------------------------#
#-------------------------------------------------------#
# 8-1 Wilcoxonの順位和検定                              #
#-------------------------------------------------------#

#----- 8-1-1 Wilcoxonの順位和検定における正確検定 ------#
# 表8-1のデータ
drugA <- c(122, 133, 145)
drugB <- c(131, 146, 147, 151)

# Wilcoxonの順位和検定（正確検定を有効にするためにexact=TRUEを指定）
wilcox.test(drugA, drugB, 
            alternative = "two.sided",                 # two.sidedで両側検定を指定
            exact = TRUE)

#--- 8-1-2 Wilcoxonの順位和検定における正規近似検定 ----#
# 表8-5のデータ
drugA <- c(131, 144, 147, 151, 152, 149, 157, 153, 170, 180, 190,
           156, 154, 173, 182, 162, 143, 161, 175, 160)
drugB <- c(128, 134, 146, 123, 188, 124, 111, 165, 135, 163, 133,
           145, 121, 179, 122, 120, 166, 132, 126, 138, 139, 140)

# Wilcoxonの順位和検定（正規近似検定を有効にするためにexact=FALSEを指定）
wilcox.test(drugA, drugB, 
            alternative = "two.sided",                  # two.sidedで両側検定を指定
            exact = FALSE, 
            correct = FALSE)


#-------------------------------------------------------#
# 8-2 Wilcoxon の符号付順位検定                         #
#-------------------------------------------------------#

#--- 8-2-1 Wilcoxon の符号付順位検定における正確検定 ---#
# 表8-6のデータ
before <- c(164, 156, 162, 149, 155, 158)
after  <- c(144, 138, 136, 154, 130, 149)

# Wilcoxonの符号付順位検定（正確検定を有効にするためにexact=TRUEを指定）
wilcox.test(after, before, 
            paired = TRUE, 
            alternative = "two.sided",                     # two.sidedで両側検定を指定 
            exact = TRUE,
            correct = FALSE)

#- 8-2-2 Wilcoxon の符号付順位検定における正規近似検定 -#
# 表8-10のデータ
before <- c(164, 156, 162, 149, 155, 158, 144, 152, 162, 139, 148, 144)
after  <- c(144, 138, 136, 154, 130, 149, 145, 130, 149, 141, 145, 150)

# Wilcoxonの符号付順位検定（正規近似検定を有効にするためにexact=FALSEを指定）
wilcox.test(after, before, 
            paired = TRUE, 
            alternative = "two.sided",                      # two.sidedで両側検定を指定
            exact = FALSE,
            correct = FALSE)